#include <stdio.h>
#include <math.h>
#include <windows.h>

int main() {

    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);
    float x, y;
    printf ("Введіть значення координат х та у\n");
    scanf ("%f%f", &x, &y);
    if(fabs(x)>1 && fabs(y)>1 ){
        printf("Точка з координатами (%f, %f) не належить заштрихованій частині площині!\n", x, y);
    }else {
        if (y>=0 && x>=0 && sqrt(y)>=x && x>=pow(y, 2)){
            printf("Точка з координатами (%f, %f) належить заштрихованій частині площині!\n", x, y);
        } else{
            if (y>=0 && x<=0 && sqrt(y)>=(-x) && (-x)>=pow(y, 2)){
                printf("Точка з координатами (%f, %f) належить заштрихованій частині площині!\n", x, y);
            } else{
                if (y<=0 && x<=0 && pow(y, 2)<=(-x) && (-x)<=sqrt(-y)){
                    printf("Точка з координатами (%f, %f) належить заштрихованій частині площині!\n", x, y);
                } else {
                    if (y<=0 && x>=0 && pow(y, 2)<=x && x<=sqrt(-y)){
                        printf("Точка з координатами (%f, %f) належить заштрихованій частині площині!\n", x, y);
                    } else {
                        printf("Точка з координатами (%f, %f) не належить заштрихованій частині площині!\n", x, y);
                    }
                }
            }y<=0 && x<=0 && pow(y, 2)<=(-x) && (-x)<=sqrt(-y);
        }
    } 
    return 0; 
    
}